update knowledge base and made deployment faster with ansible added features f suspend restart and destroy
